# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8-defectdef.yaml' will call yolov8-defectdef.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 1, 1024] # YOLOv8-defectdef summary: 191 layers, 11,033,166 parameters, 11,033,150 gradients, 48.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  # args: [out_channels, k, s, p]
  - [-1, 1, Enc, [32, 3]] # 0
  - [-1, 1, Enc, [32, 3]] # 1
  - [-1, 1, Enc, [32, 3]] # 2
  - [-1, 1, Enc, [32, 3]] # 3
  - [-1, 1, Enc, [32, 3]] # 4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 5
  - [[-1, 3], 1, Concat, [1]] # 6
  - [-1, 1, Dec, [32, 1]] # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 8
  - [[-1, 2], 1, Concat, [1]] # 9
  - [-1, 1, Dec, [32, 1]] # 10

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 1], 1, Concat, [1]] # 12
  - [-1, 1, Dec, [32, 1]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 0], 1, Concat, [1]] # 15
  - [-1, 1, Dec, [32, 1]] # 16

  - [-1, 1, Conv, [64, 3, 1]] # 17
  - [-1, 1, Conv, [64, 3, 2]] # 18
  - [-1, 1, Conv, [64, 3, 2]] # 19 P3
  - [-1, 1, Conv, [64, 3, 2]] # 20 P4
  - [-1, 1, Conv, [64, 3, 2]] # 21 P5
  - [-1, 1, Conv, [64, 3, 2]] # 22 P6
  - [-1, 1, Conv, [64, 3, 2]] # 23 P7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24
  - [[-1, 22], 1, Concat, [1]] # 25

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 26
  - [[-1, 21], 1, Concat, [1]] # 27

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 28
  - [[-1, 20], 1, Concat, [1]] # 29

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 30
  - [[-1, 19], 1, Concat, [1]] # 31 P3 Detect

  - [-1, 1, Conv, [64, 3, 2]] # 32
  - [[-1, 20, 29], 1, Concat, [1]] # 33 P4 Detect

  - [-1, 1, Conv, [64, 3, 2]] # 34
  - [[-1, 21, 27], 1, Concat, [1]] # 35 P5 Detect

  - [-1, 1, Conv, [64, 3, 2]] # 36
  - [[-1, 22, 25], 1, Concat, [1]] # 37 P6 Detect

  - [-1, 1, Conv, [64, 3, 2]] # 38
  - [[-1, 23], 1, Concat, [1]] # 39 P7 Detect


# YOLOv8.0n head
head:
  - [[31, 33, 35, 37, 39], 1, Detect, [nc]] # Detect(P3, P4, P5)
